/*
    Написать класс матриц, поддерживающий операцию транспонирования.
    Должны быть описан один класс, который должен:
        инкапсулировать в себе массив-матрицу;
        иметь конструктор, параметрами которого являются размеры матрицы;
        реализовывать получение размеров матрицы;
        реализовывать получение и изменение отдельных элементов матрицы;
        иметь статический метод транспонирования матриц, возвращающий транспонированную матрицу.
 */

public class Main
{
    public static void main(String[] args)
    {

    }
}